{
    "name": "class.pages",
    "display": "Объект Pages",
    "purpose": "Гибкий механизм пагинации длинных массивов",
    "way": "Возвращает ограниченную версию массива согласно установленным критериям. <br><br>Система пагинации (разбиения на страницы) имеет 4 параметра в строгом порядке. Подробнее о параметрах можно узнать ниже в секции Запрос. Правила пагинации могут задаваться как индивидуально, так и универсально. <ul><li>Уникально</li></ul> Каждый объект Pages имеет числовой идентификатор, который указан в документации. Этот идентификатор не обязательно уникальный в области одного метода (контроль над несколькими Pages через один ID). Для передачи настроек под каждый ID используется сериализация. Подробнее об этом можно прочитать в описании <a href=\"#b-global_vars.pages_config\">глобального параметра `pages_config`</a>. Для настройки определенного ID его нужно указать как ключ в объекте, а в значении передать набор правил (пример #1). <br><br>Правила передаются как 4 целых числа, разделенные запятой. Если нужно использовать значение по умолчанию, вместо числа можно написать нижнее подчеркивание (_) (пример #3) или не записывать число вообще (пример #4), если оно находится у конца и это не нарушает порядок задания настроек. Значения по умолчанию могут быть индивидуальны для конкретного объекта. Об этом сообщено в описании данного объекта. <ul><li>Универсально</li></ul> ID 0 - зарезервированный идентификатор. Он используется для задания значений по умолчанию для всех объектов, если не произойдет конфликтов с ограничениями для, как минимум, одного из них. Он может быть указан на ряду с другими идентификаторами. Если задание конкретных правил не планируется, для задания универсальных можно использовать упрощенную форму - просто записать само правило для ID 0 без дополнительных обрамлений (пример #2). Здесь также работают правила системных и конкретных умолчаний.<br><br>Правила задаются в такой последовательности (слои): Системные умолчания [0, 10, 1, 1] -> Уникальные умолчания (из документации для конкретного объекта) -> Пользовательские умолчания (ID 0) -> Конкретные правила. При использовании умолчаний из примеров #3 и #4 значения дублируются из слоя ниже.<br><br><ul><li>Примеры</li></ul>\n<b>#1</b>: pages_config=|1::0,20,1,0||2::2,10,0,0|<br><b>#2</b>: pages_config=5,_,2<br><b>#3</b>: pages_config=|1::_,_,2,0|<br><b>#4</b>: pages_config=|1::2,3|", 
    "request": [
        {
            "name": "offset",
            "type": "int",
            "important": false,
            "info": "Сдвиг заставляет массив начинаться с n-ого элемента. Рекомендуемый способ управления постраничным выводом: Сдвиг = Количество * страница. Минимальное значение = 0"
        },
        {
            "name": "count",
            "type": "int",
            "important": false,
            "info": "Количество устанавливает ограничитель на, логично, количество выводимых элементов массива. Разные объекты могут иметь собственные лимиты на количество выводимых данных, которые устанавливаются настрого и не могут быть изменены"
        },
        {
            "name": "page",
            "type": "int",
            "important": false,
            "info": "Страница может быть использована тем, кто считает, что сдвиг не для него. Выводит каждые [count] элементов"
        },
        {
            "name": "pageJump",
            "type": "binary",
            "important": false,
            "info": "Разрешение на сдвиг страницы по сути убирает [offset] первых элементов со страницы. Данный флаг запрещает вывод элементов другой страницы (\"другой\" страницы при сдвиге = 0)."
        }
    ]
}